artillery/load-test.yml
config:
  target: "http://127.0.0.1:8000"
  phases:
    - duration: 1
      arrivalCount: 2
  payload:
    path: "questions.csv"
    fields:
      - question
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: 2 simultaneous questions
    flow:
      - post:
          url: "/conversation"
          json:
            session_id: "{{ $randomNumber(10000,99999) }}"
            mensaje: "{{ question }}"